[
  {
    "author": "Lesley",
    "title": "Birthday Weekend",
    "text": "Fabulous experience at St Regis AGAIN! This is my favorite resort on Miami Beach - excellent service, style and beach location. Can't wait to return...!!",
    "date": "October 8, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "Gitithacham",
    "title": "Best location",
    "text": "Didn’t got to enjoy the place I came for a short time",
    "date": "October 7, 2019",
    "score": 4.0,
    "location_score": 5.0
  },
  {
    "author": "Marie",
    "title": "Hotel que cumple lo que promete.",
    "text": "Excelente servicio de todo el personal en todas las áreas, el servicio de limpieza nunca nos molestó y siempre hicieron el servicio sin que nos diéramos cuenta en el momento en que no nos encontrábamos en la habitación. Todo fue muy bueno incluyendo el servio del valet parking.",
    "date": "October 6, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "Anonymous",
    "title": "12 Year Anniversary",
    "text": "Our stay at the St. Regis Miami was more than we could have ever hoped for. From booking our reservations to the service we experienced there was nothing lacking. We will definitely be making the St. Regis our hotel of choice when traveling in the future.",
    "date": "October 6, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "Ratcliff",
    "title": "Top level stay",
    "text": "From the lobby to the rooms to the service...it’s all incredible. Get there as soon as you can!",
    "date": "October 3, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "October 4, 2019",
        "text": "Dear Ratliff,\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "MikeE",
    "title": "I wish I lived there!",
    "text": "First class from arrival through departure.",
    "date": "October 3, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "October 6, 2019",
        "text": "Dear MikeE,\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anisah",
    "title": "Great Stay-cation!",
    "text": "My husband and I decided we needed a small stay-cation and chose the St. Regis in Bal Harbour. From the moment we stepped into the hotel, we were transported to another world. The ambiance and service was above and beyond and the oceanfront view was breathtaking. There was so much attention to detail, including the pillow spray with turndown service, the digital blinds and the best part for me- the soaking tub.",
    "date": "October 2, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "October 3, 2019",
        "text": "Dear Anisah:\nThank you for being our guest and for the generous rating of The St. Regis Bal Harbour Resort. Awarded the Forbes five-star and AAA five-diamond award, our hotel is located across from the celebrated Bal Harbour Shops, and not far from the dynamic energy of South Beach. We appreciate hearing how much you enjoyed getting away with us and we hope you will come back to see us soon.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "DJ",
    "title": "Staff do not care",
    "text": "No one cares about your experience. They rely on the nice rooms to get by.",
    "date": "October 2, 2019",
    "score": 1.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "October 3, 2019",
        "text": "Dear DJ:\nWe are committed to providing extraordinary service to our guests, wish you to know that your feedback is essential to our team. We wish to extend our apologies and would welcome another opportunity to show you with the hospitality for which we are known.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Jj",
    "title": "St. Regis is exceptional in every category.",
    "text": "St. Regis is exceptional in every category!",
    "date": "September 28, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "September 29, 2019",
        "text": "Dear Jj,\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Paul",
    "title": "Sales trip",
    "text": "Nice hotel with friendly staff. Enjoyed our time,\nBut fitness center is sub-standard for this quality of hotel",
    "date": "September 24, 2019",
    "score": 4.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "September 26, 2019",
        "text": "Dear Paul:\nThank you for taking the time to tell us about your visit. We are pleased your overall stay was enjoyable, and appreciate you kind words for staff. But we want it to be flawless and are passionate about exceeding the expectations of our guests, so thank you for your suggestions. Thank you for choosing our hotel, and we hope you will give us another opportunity to welcome you to the perfect stay you deserve.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Manuel",
    "title": "FANTASTICO HOTEL",
    "text": "Hotel perfecto para descansar, muy silencioso y excelente ubicación, linda vista y los cuartos de excelente tamano",
    "date": "September 23, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "Windswept1",
    "title": "Luxury beyond compare.",
    "text": "The moment one enter this St Regis, you are surrounded by beauty and charm. Met by a warm skilled staff, one can relax into the rest of the day. Hard to believe how consistently wonderful the staff are at this property. One just has to experience this first hand. Looking for a rewarding experience trimmed with art in simple elegant surroundings, and served by amazing people, this St Regis is the place for pleasure or business travel.",
    "date": "September 22, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "September 23, 2019",
        "text": "Dear Windswept1:\nThank you for being our recent guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments for both our property and staff, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with all of our team, and we hope to be your home every time your travels bring you to the area.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anonymous",
    "title": "Buena",
    "text": "En general todo muy bien excepto la calidad del Buffet y del Brunch.- La fruta verde y el resto de la oferta me hizo desestimar continuar consumiendo el desayuno Buffet y el Brunch la relación precio calidad no es la adecuada.- El costo del Vino Blanco es desmesurado en el Buffet.- Contrasta con los platos del desayuno a la carta que son superiores",
    "date": "September 22, 2019",
    "score": 4.0,
    "location_score": 5.0
  },
  {
    "author": "TheBigBoss",
    "title": "Go Big or Go Home",
    "text": "St. Regis Bal Harbour was the perfect Resort for our 20 year anniversary.",
    "date": "September 21, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "September 22, 2019",
        "text": "Dear TheBigBoss,\nThank you for choosing The St. Regis Bal Harbour Resort for your anniversary celebration. Our location provides an escape like no other; with the Atlantic Ocean at our doorstep, the legendary Bal Harbour Shops across Collins Avenue, and much more only moments away. We appreciate you sharing how much you enjoyed your stay and we look forward to your next visit.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Tiya",
    "title": "Wonderful Stay",
    "text": "The hotel has great view and excellent service. It’s right across the street from Bal Harbour shopping center. Great location!",
    "date": "September 20, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "September 21, 2019",
        "text": "Dear Tiya,\nThank you for choosing The St. Regis Bal Harbour Resort during your visit to Miami. Our location provides an escape like no other; with the Atlantic Ocean at our doorstep, the legendary Bal Harbour Shops across Collins Avenue, and much more only moments away. We appreciate you sharing how much you enjoyed our great view, location, and excellent service. We look forward to your next visit.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Maca",
    "title": "Wonderful Weekend Getaway",
    "text": "The hotel is conveniently located close to shopping and dinning. The staff is friendly and professional, they try to accommodate all your needs. I would recommend this hotel to anyone going to Miami who is interested in a upscale experience.",
    "date": "September 10, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "September 11, 2019",
        "text": "Dear Maca,\nOn behalf of our associates, thank you for the generous review. Perfect for upscale getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved our convenient location, professional staff, and overall experience. It was a pleasure to be a part of your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "AF",
    "title": "Staying during hurricane season",
    "date": "September 8, 2019",
    "score": 2.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "September 10, 2019",
        "text": "Dear AF: Thank you for visiting us for your anniversary celebration and for taking the time to share your review. We are disappointed that Hurricane Dorian disrupted our available services and that we missed significant opportunities to show you our commitment to service excellence. We want to thank you for your patience and hope to have another opportunity on your next visit to the area to provide you with the superb hospitality for which we are known.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "GregWoods",
    "title": "Vacation Greg Woods",
    "text": "Great!Will definitely stay again.",
    "date": "September 3, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "September 4, 2019",
        "text": "Dear GregWoods,\nThank you for the generous rating of The St. Regis Bal Harbour Resort. Awarded the Forbes five-star and AAA five-diamond awards for 2017, our hotel is located across from the celebrated Bal Harbour Shops, and not far from the dynamic energy of South Beach. We appreciate hearing how much you enjoyed a perfectly relaxing vacation with us and look forward to seeing you soon for another memorable experience.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Dvdstreet",
    "title": "No Manager on Duty",
    "text": "We left on the weekend of Dorian, room service wasn’t open as advertised (their changed, updated hours were changed without notifying guests), and there was no manager on duty upon our checkout Sunday morning. Miami was out of the “cone” beginning at least Saturday. I understand everyone needs to be safe, but if the hotel is going to be open, someone should be in charge.",
    "date": "September 3, 2019",
    "score": 3.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "September 5, 2019",
        "text": "Dear Dvdstreet,\nThank you for choosing us and taking the time to leave a review. We apologize for the issues and inconveniences you experienced during your stay with us. We aim to give each guest the absolute best service possible, and we hate that we fell short. This is not the level of service we usually provide, so we regret you left with an unfavorable opinion of our hotel. We have shared your concerns with our staff to ensure we are providing the best visit we possibly can to our guests. Please contact us directly to discuss further details and concerns regarding your stay with us. We appreciate your business and wish you all the best in your future travels.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "SherylPaparella",
    "title": "Excellent Service",
    "text": "St. Regis Bal Harbor is an excellent location and a beautiful property. I would highly recommend. You will be treated like Royalty. The staff is helpful, friendly and very professional.",
    "date": "September 2, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "September 2, 2019",
        "text": "Dear Guest,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with such a relaxing and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "RobE",
    "title": "Great Hotel with impeccable service.",
    "text": "Awesome staff that will appease your every need and concern. Beach access is great with chairs and umbrellas included. Every room is oceanfront with huge balconies and daybeds. Wife and I would definitely return.",
    "date": "September 1, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "September 1, 2019",
        "text": "Dear Guest,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could appease your every need and concern. We will enjoy sharing your compliments with our team, and we are glad to hear we can be your home again when your travels bring you back to Miami.\nSincerely,\nGuest Recognition Manager"
      },
      {
        "author": "September 1, 2019",
        "text": "Dear Guest,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could appease your every need and concern. We will enjoy sharing your compliments with our team, and we are glad to hear we can be your home again when your travels bring you back to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Fritz",
    "title": "Aniversario de bodas",
    "text": "Excelente Hotel , servicio amable, muy buenas habitaciones con na vista al mar. La oferta gastronómica es bastante sencilla, quizás destaca el sushi bar. La verdad que un Hotel con estas características merece tener un restaurant de mayor nivel al ofrecido",
    "date": "August 29, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "August 30, 2019",
        "text": "Dear Fritz,\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Blah",
    "title": "Nice hotel but you may hear noise from next door",
    "text": "It’s a great location but we had some issues during our brief stay, our main complaint was we kept hearing our neighbors above us. The rooms have massive sliding doors and they are audible if you happen to be below a unit that is occupied. Our upstairs neighbors were opening the balcony door throughout the night, suffice to say we did not get much sleep.",
    "date": "August 28, 2019",
    "score": 3.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "August 30, 2019",
        "text": "Dear Blah,\nWe apologize for the disturbances from other guests during the night. We are sorry you did not sleep well in our hotel and that if you did notify us, we failed to resolve the problem while you are here. We appreciate your feedback and hope you will stay with us again in the future.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "LizFerreri",
    "title": "Visiting Miami",
    "text": "Beatiful hotel. Orchids and flowers everywhere.",
    "date": "August 25, 2019",
    "score": 5.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "August 26, 2019",
        "text": "Dear LizFerreri:\nThank you for visiting with us and for the generous rating of The St. Regis Bal Harbour Resort. Awarded the Forbes five-star and AAA five-diamond awards, our hotel is located across from the celebrated Bal Harbour Shops, and not far from the dynamic energy of South Beach. We appreciate hearing how much you enjoyed our property and lovely grounds and we hope you will come back to see us soon.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "MazieMAlpert",
    "title": "Experience",
    "text": "Overall, St. Regis is AMAZING!\nStaff is so nice, friendly, accommodating!",
    "date": "August 24, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "August 24, 2019",
        "text": "Dear Guest,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "VinodRathore",
    "title": "Stay at St. Regis",
    "text": "Excellent rooms and staff that went the extra mile to make our stay memorable.",
    "date": "August 24, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "August 25, 2019",
        "text": "Dear VinodRathore,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      },
      {
        "author": "August 25, 2019",
        "text": "Dear VinodRathore,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "A7starhotel",
    "title": "Outstanding hotel",
    "text": "Staff are so courteous, welcoming and helpful. Rooms are spacious and neatly designed, balcony view is amazing, beach and spa service is so great.",
    "date": "August 23, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "Anonymous",
    "title": "there is nothing wrong to say.",
    "text": "I would have liked on my arrival in that heat a wet cloth to freshen up, definitely not champagne in the middle of the day, a nice glass of chilly fruit juice, I would also have liked to have a coffee machine in my room so that when I wake up in the morning to be able to have a cup of coffee, also when I wake up after my noon rest.",
    "date": "August 21, 2019",
    "score": 4.0,
    "location_score": 5.0
  },
  {
    "author": "Duaine",
    "title": "My 20th Anniversary",
    "text": "My wife and I celebrated our 20th Anniversary at the St. Regis Bal Harbor. The experience was as a perfect starting gate for our next. 20.",
    "date": "August 20, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "August 21, 2019",
        "text": "Dear Duaine:\nFirst of all, congratulations on your wedding anniversary and thank you for spending it with us. We are perfect for celebratory getaways or family vacations, and offer a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "ChrisHulse",
    "title": "Mr. Hulse",
    "text": "Great place to stay with plenty of amenities.",
    "date": "August 19, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "August 20, 2019",
        "text": "Dear ChrisHulse:\nOn behalf of our associates, thank you for the kind words and generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved all that we have to offer, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "NA",
    "title": "Wonderful place",
    "text": "I loved everything! Beautiful hotel,nice staff great service",
    "date": "August 19, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "August 22, 2019",
        "text": "Dear NA:\nThank you for being our guest at The St. Regis Bal Harbour Resort and for your comments. We are pleased that we could provide you with a seamless and meaningful stay and will enjoy sharing your compliments with our team. We hope to be your home every time your travels bring you to the Miami area.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "MariaCGF",
    "title": "St. Regis Bal Harbour deixa a desejar",
    "text": "Não espere qualidade no atendimento do St Regis Bal Harbour. É apenas um hotel bonito.",
    "date": "August 12, 2019",
    "score": 2.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "August 15, 2019",
        "text": "Dear MariaCGF:\nThank you for visiting and for letting us know about your experience. We are committed to providing extraordinary service to our guests, and we regret if these standards got overlooked while you were with us. Your feedback is essential to our team, and we want to extend our apologies. We would welcome another opportunity to show you with the hospitality for which we are known.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Eric",
    "title": "My Favorite Hotel :)",
    "text": "I continue to return to the St. Regis, over and over again because of the way we are treated there. It is just wonderful!",
    "date": "August 9, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "August 10, 2019",
        "text": "Dear Eric,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to continue to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "MuhammadK",
    "title": "St. Regis Bal Harbour",
    "text": "Loved the stay, really appreciated the personalized service.",
    "date": "August 9, 2019",
    "score": 5.0,
    "location_score": 3.0,
    "responses": [
      {
        "author": "August 9, 2019",
        "text": "Dear MuhammadK,\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "JeremyA",
    "title": "Beautiful Rooms: Missing Something",
    "text": "The hotel is beautiful. It is missing something with service though. Not even sure what it is but I felt very much like the lone man out or just significantly less important than others there. As a young guy, this really turned me off from the property. I highly enjoy luxury travel and do it a lot, especially travel for work, and just came back, yes with a tan, but just saying, \"it was okay\".",
    "date": "July 30, 2019",
    "score": 3.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "August 2, 2019",
        "text": "Dear JeremyA,\nThank you for choosing us for your recent Miami visit. We are genuinely sorry for the experience you had with our staff. We strive to provide authentic and caring service from each member of our team, and we are grateful for feedback that helps us improve our services. We have shared your concerns with the appropriate individuals to ensure this is not repeated. We appreciate your patience and hope you will consider staying with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Mateus",
    "title": "Estada St Regis",
    "text": "Ótima localização , conforto e atendimento excelente , ficou a desejar no apartamento relacionado ao colchão e um alto barulho da geladeira",
    "date": "July 30, 2019",
    "score": 4.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "August 3, 2019",
        "text": "Dear Mateus,\nThank you for your review of our hotel. We are pleased your overall stay was enjoyable, and we appreciate feedback that helps us improve our guest experience. We apologize for the inconvenience with the noise from the fridge. We will address this with the appropriate individuals and take suitable action. We hope you will consider a return visit so we can show you we are devoted to giving each guest an exceptional stay.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "LJG",
    "title": "Jlo concert and 50th Anniversary stay",
    "text": "Was surprised with Gold Elite no early check in was available",
    "date": "July 30, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "Shelley",
    "title": "Exceptional Staff and Outstanding Service",
    "date": "July 30, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 31, 2019",
        "text": "Dear Shelly:\nThank you for being our guest at The St. Regis Bal Harbour Resort and for your review. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing all your compliments with our team, and we hope to be your home every time your travels bring you to South Florida.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Caroline",
    "title": "Café da manha",
    "text": "O café da manhã é caro parabuma familia com 4 pessoas, onde crianças de 7 anos pagam integralmente. Não tem uma opção mais razoavel. Cobrar 49 dólares para um café da manhã é muito alto.",
    "date": "July 23, 2019",
    "score": 3.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 24, 2019",
        "text": "Dear Caroline: Thank you for visiting and for your review. We appreciate feedback that helps us improve our guest experience, and appreciate you comments regarding our breakfast offerings. I hope you will consider a return visit so we can show you we are devoted to giving each guest an exceptional stay.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "CLNG",
    "title": "St. Regis BalHarbour",
    "text": "Hotel é excelente, tudo é perfeito e indicado para família.",
    "date": "July 16, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 17, 2019",
        "text": "Dear CLNG: It was a pleasure to welcome you to The St. Regis Washington, D.C. Thank you for mentioning how much you enjoyed that our property was suitable for family enjoyment. We are passionate about creating a welcoming and authentic atmosphere, and we appreciate the acknowledgment of our devotion. It was a pleasure having you as our guest, and we hope to see you soon.\nSincerely,\nMr. Felix Schaller\nDirector of Operations"
      }
    ]
  },
  {
    "author": "SHARONMUALEM",
    "title": "Not right for quiet time",
    "text": "Ongoing construction prevented rest and relaxation at this resort.",
    "date": "July 15, 2019",
    "score": 2.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 16, 2019",
        "text": "Hello. Thank you for being our guest and for your comments. We are very sorry your stay was interrupted by ongoing maintenance and construction issues. We apologize for the inconvenience, appreciate your patience, and look forward to another opportunity to provide you with the perfect stay.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anonymous",
    "title": "A wonderful stay. !!!!!!!!!!!!!!!",
    "text": "Excellent service. !!!!!!!!!!!!!",
    "date": "July 14, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 18, 2019",
        "text": "Hello. Thank you for being our guest at The St. Regis Bal Harbour Resort and for your comments. We are pleased that the service provided by our staff could help you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to the area.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Sammy",
    "title": "Baby moom",
    "text": "Amazing beautiful ambiance greatest staff",
    "date": "July 11, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 14, 2019",
        "text": "Dear Sammy,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      },
      {
        "author": "July 12, 2019",
        "text": "Dear Sammy,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "NancyH",
    "title": "Top-notch service with luxurious setting",
    "text": "We had a short stay st the StR in BH, but wow what an experience. Our jr suite had a huge balcony with 2 loungers. We spent most afternoons there napping after spending the day at the pool and the beach. The butler service was very helpful in getting a couple of issues in the room resolved. The hotel itself is beautiful enough to be a museum. Wouldn’t hesitate to stay there again.",
    "date": "July 10, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 11, 2019",
        "text": "Dear NancyH: It was our pleasure welcoming you to The St. Regis Bal Harbour Resort. We are delighted that your experience was perfect from beginning to end. We enjoy knowing that our guests can relax and feel at home in their gorgeously appointed rooms and awaken each morning to the gentle breeze of the Atlantic. On behalf of all of us, we thank you for taking the time to review our hotel, and we hope to see you again soon.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "EddyBalma",
    "title": "Best of the Best",
    "text": "This property was special for us. Had a suite with two balcony decks over the beach. Service , food and staff were all 5 stars. I will return and highly recommend .",
    "date": "July 9, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 9, 2019",
        "text": "Dear Ebalma: Thank you for choosing The St. Regis Bal Harbour Resort and for your review. It is inspiring to know that we exceeded your expectations and that you particularly enjoyed our fantastic views of the Atlantic Ocean. It was a pleasure having you as our guest, and we hope to have the opportunity to welcome you back soon.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "ExceededExpectation",
    "title": "Finest hotel staff I have ever experienced",
    "text": "The staff was attentive to every need, but not in your face. The professionalism extended across-the-board. The Butler‘s, the cleaning people, the management, and anyone else I encountered was polite and helpful.",
    "date": "July 6, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 13, 2019",
        "text": "Dear ExceededExpectation,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "scg",
    "title": "improvement",
    "text": "While at the hotel everything and every expectation was exceeded, however when calling with questions (before and after stay) people where not friendly. For example when requesting an itemized statement from Shelby at the fiance department, she was not kind at all. Overall experience at the hotel we impeccable but the \"over the phone\" etiquette has room for improvement .",
    "date": "July 2, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 5, 2019",
        "text": "Dear scg,\nThank you for taking the time to tell us about your visit. We are pleased your overall stay was enjoyable, but we want it to be flawless. We are passionate about exceeding the expectations of our guests, and we genuinely apologize for not doing so during your time with us. Thank you for choosing our hotel, and we hope you will give us another opportunity to welcome you to the perfect stay you deserve.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "JoshK",
    "title": "Great Service.",
    "text": "We had an amazing stay at the St Regis. Everything exceeded our expectations.",
    "date": "July 1, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 2, 2019",
        "text": "Dear JoshK; On behalf of our associates, thank you for visiting with us and for the generous review. Perfect for celebratory getaways or family vacations, we offer a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anonymous",
    "title": "Mrs",
    "text": "Very good Resort for a family",
    "date": "July 1, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "July 7, 2019",
        "text": "Dear Guest,\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you and your family visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Meg",
    "title": "Great Stay!",
    "text": "Staying at the St Regis Bal Harbour was amazing. The room, view and beaches were great. HIGHLY RECOMMEND STAYING HERE. They value your platinum status unlike the Ritz which I really appreciated. Overall awesome service at the pool and beach. They could use a few more servers down by the beach. The Atlantikos restaurant had snobby waiters who acted like they were too good to service you but the breakfast food was good. However, I didn't experience this type of service anywhere else at the hotel.",
    "date": "June 27, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 28, 2019",
        "text": "Dear Meg,\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anonymous",
    "title": "Sensacional",
    "text": "Experiência única do check In até o final!!! Extraordinário atendimento e conforto em todas as áreas do hotel!",
    "date": "June 25, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 27, 2019",
        "text": "On behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know that you experience was unique and extraordinary and that you loved your stay. We look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "MARCE",
    "title": "Excelente",
    "text": "muy bueno todo, la pase genial. muy calido el servicio",
    "date": "June 25, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "Toronto",
    "title": "Late Checkout Denied",
    "text": "After paying posted rate in low season and letting hotel know our flight was late they denied a late checkout multiple times.",
    "date": "June 24, 2019",
    "score": 3.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "June 27, 2019",
        "text": "Thank you for your comments, as we appreciate feedback that helps us improve our guest experience. We apologize for the inconvenience of your check out while you were our guest. We will address this with the appropriate individuals and hope you will consider a return visit so we can show you we are devoted to giving each guest an exceptional stay.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anonymous",
    "title": "An Amazing Hotel",
    "text": "The Bal Harbour St Regis is perfect in every way, from the staff that caters to your every need to the gorgeous rooms. You will never be disappointed staying there.",
    "date": "June 23, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 26, 2019",
        "text": "Thank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your kind comments, and we are pleased that we could provide you with a perfectly seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to our area.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "2019gc",
    "title": "Bal harbour st regis",
    "text": "Not as good as what we expected. Dinning in the alantokos below average.",
    "date": "June 22, 2019",
    "score": 4.0,
    "location_score": 4.0
  },
  {
    "author": "MARIA17",
    "title": "SOBRESALIENTE",
    "text": "SOBRESALIENTE SERVICIO\nEL MEJOR DE TODO MIAMI\nA SEGUIR SUPERANDOSE DIA A DIA",
    "date": "June 21, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 23, 2019",
        "text": "Dear MARIA17,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anonymous",
    "title": "Superb Property Not To Miss",
    "text": "From the moment you arrive you feel as if you are royalty. The staff is courteous, attentive and want you to have a superb stay. The rooms are over the top, the bathrooms are large, private and the attention to detail is obvious. The food is top notch and the pool and beach attendants only too happy to assist. We lived this property!!!! Worth every penny!!!!",
    "date": "June 20, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "Anonymous",
    "title": "Exelente",
    "text": "Desde que empece a parar en este hotel, cada vez que puedo me alojo en los hoteles St. Regis, ya sea en Roma, Florencia y no recuerdo algun otro.\nEste fin de ano vanos a pasarlo en Paris y nos alojaremos en el St. Regis de esa ciudad",
    "date": "June 20, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "MichellePowell",
    "title": "Our Anniversary stay",
    "text": "Our experience was excellent. We have been here several times and it is definitely our favorite hotel",
    "date": "June 18, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 19, 2019",
        "text": "Dear MichellePowell: Thank you for being our guest once again at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and look forward to welcoming you again soon.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "SamB",
    "title": "Aucun Service",
    "date": "June 18, 2019",
    "score": 2.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "June 20, 2019",
        "text": "Dear SamB: Thank you for visiting and for taking the time to evaluate our hotel. We are truly sorry your stay was not the exceptional experience you deserve and apologize for these situations that you've noted. We never want a guest to leave with a contrary opinion, and if given the opportunity, we would have taken measures to address every concern while you were staying with us. We hope you will consider giving us another chance to provide you with the flawless and meaningful stay you deserve.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Alex",
    "title": "Nice Hotel",
    "text": "Wonderful Rooms, and nice Beach",
    "date": "June 17, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 18, 2019",
        "text": "Dear Alex: Thank you for your feedback. We are glad you had an exceptional stay, and that you were able to take advantage of our dazzling beachfront and beach service. It was our pleasure being a part of your Miami visit, and we look forward to seeing you again soon.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "MrandMrsAli",
    "title": "Amazing Experience",
    "text": "The Staff of the St. Regis in Bal Harbour were extremely kind and helped make this experience unforgettable. The property was phenomenal and our room was extravagant. We look forward to booking our next stay with the St. Regis!",
    "date": "June 13, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 16, 2019",
        "text": "Dear MrandMrsAli,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anonymous",
    "title": "Good",
    "text": "Good. Enjoyed the room and stay",
    "date": "June 12, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 15, 2019",
        "text": "Dear Guest,\nIt was our pleasure welcoming you to The St. Regis Bal Harbour Resort. We are delighted that your experience was perfect from beginning to end. We enjoy knowing that our guests can relax and feel at home in their gorgeously appointed rooms and awaken each morning to the gentle breeze of the Atlantic. On behalf of all of us, we thank you for taking the time to review our hotel, and we hope to see you again soon.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "CouplesGetaway",
    "title": "Excellence!",
    "date": "June 11, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 22, 2019",
        "text": "Dear Guest,\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "JasonS",
    "title": "Perfect Anniversary Weekend",
    "text": "great property with great service",
    "date": "June 11, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 12, 2019",
        "text": "Dear JasonS: Thank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to South Florida.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "CJ",
    "title": "St. Regis Deloitte meetings",
    "text": "Very nice hotel - I will be returning",
    "date": "June 11, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "SylviaM",
    "title": "Elegance",
    "text": "The attention to detail is phenomenal, as well as the personal touch of everyone knowing who you are. They are excellent at anticipating your every need.",
    "date": "June 11, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 13, 2019",
        "text": "Dear SylviaM: Thank you for being our guest at The St. Regis Bal Harbour Resort and for your comments. We are grateful for your kind words and are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to the Miami area.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Jacquelinepsico",
    "title": "Experiencia única",
    "text": "Fue una estadía perfecta, el personal muy amable y servicial, las instalaciones muy bellas y bien cuidadas y lo mejor la ubicación del hotel",
    "date": "June 11, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "GRajaratnam",
    "title": "DISAPPOINTED WITH FRONT DESK",
    "text": "Pros: Beautiful hotel and great view of the ocean from our room. Delicious food at Atlantikós.\nCons: We had a displeasing check in process with front desk receptionist, Salma. She did not offer champagne upon arrival, declined late checkout, did not inform butler service to set up a birthday surprise for our arrival.",
    "date": "June 9, 2019",
    "score": 2.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "June 14, 2019",
        "text": "Dear GRajaratnam,\nThank you for taking the time to share your review. We are disappointed that we missed several significant opportunities to show you our commitment to service excellence. We regret not living up to our hotel's name, and we want to thank you for your patience. We hope to have another opportunity on your next visit to Miami to provide you with the superb hospitality for which we are known.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "ZmanNH",
    "title": "Outstanding resort-one of Marriott’s best",
    "text": "First time stay at St Regis Bal Harbour, this property ranks in the top three in my 40+ years of traveling. Service is outstanding. Restaurants all five star. Property is beautiful. Pools are great and poolside service best in class.",
    "date": "June 4, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 5, 2019",
        "text": "Dear ZmanNH:\nOn behalf of our associates, thank you for the generous review. As you have discovered, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay and to be listed among your favorite places. We look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "DisappointedGuest",
    "title": "St Regis Bal Harbor",
    "text": "Stay away. Old property. Terrible service. Horrible and overpriced food. Don’t go to the lounge at night. At best they hired some karaoke singer worse than my pet dog to sing.",
    "date": "June 1, 2019",
    "score": 1.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "June 4, 2019",
        "text": "Hello: Thank you for visiting and for taking the time to evaluate our hotel. We are truly sorry your stay was not the exceptional experience you deserve. Your observations are welcome and appreciated as we are always working to improve and planning for the future. We hope you will consider giving us another chance to provide you with the flawless and meaningful stay you deserve.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "none",
    "title": "Stay at the St Regis",
    "text": "I travel frequently for business and the St Regis stands out for luxury and service. The rooms are not cheap but are if you want luxury, this is the place to be. The fees for in-room alcohol is excessively expensive and parking is high as well.",
    "date": "May 30, 2019",
    "score": 4.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 31, 2019",
        "text": "Dear none,\nThank you for your review of our hotel. We are pleased your overall stay was enjoyable, and we appreciate feedback that helps us improve our guest experience. We apologize for the inconvenience with the prices of the beverages in your room and our parking fee. We will address this with the appropriate individuals and take suitable action. We hope you will consider a return visit so we can show you we are devoted to giving each guest an exceptional stay.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "ShawnLyons",
    "title": "Amazing Experience",
    "text": "I can't say enough how impressed we were with everything, we mostly dealt with Philip in the Cabana, we had the same Cabana for 3 straight days and he took unbelievable care of us. He was amazing, and we will be back to visit him at the Cabana.",
    "date": "May 29, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 30, 2019",
        "text": "Dear ShawnLyons:\nThank you for visiting and for the warm compliments regarding your stay at The St. Regis Bal Harbour Resort. It is lovely to know how much you enjoyed our devoted staff, particularly Philip. We appreciate you taking the time to share your experience, and we look forward to your next visit.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "CherylandBill",
    "title": "Best Service Anywhere",
    "text": "If you want luxury your choice should be the St Regis",
    "date": "May 27, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 29, 2019",
        "text": "Dear CherylandBill:\nOn behalf of all our associates, thank you for the kind comment. The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "ZaidaM",
    "title": "Five Star resort close to home",
    "text": "Unassuming on the outside, full of ritz and glamour on the inside. Superb service and elegance throughout the resort. There is something for everyone here, child friendly , romantic, great pools and Beach, excellent restaurants and the perfect location in south Florida.",
    "date": "May 27, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 28, 2019",
        "text": "Dear ZaidaM:\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort does indeed have everything. We offer a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "TinaB",
    "title": "The best service and a gorgeous hotel",
    "text": "This is my 3rd stay at this property and I love it. The pool and the beach are beautiful and the attendants make sure your needs are taken care of and the rooms are amazing. The staff is genuine and so helpful.\nBest place to relax and unwind.",
    "date": "May 26, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 27, 2019",
        "text": "Dear TinaB:\nThank you for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your generous comments, and for mentioning our terrific location. We are pleased that we could provide you with a seamless and meaningful stay and will enjoy sharing your compliments with our team. We hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "GeorgeA",
    "title": "A lovely 5 star hotel",
    "text": "I think i already said it all",
    "date": "May 25, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "June 8, 2019",
        "text": "Dear Guest,\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "DMS",
    "title": "Luxury at its best",
    "text": "I have 3k nights stayed and 10 million lifetime points.\nThis property is without a doubt one of the all time best of the best.While it's easy to build a great property it's another to fill it with a great staff. No request is too small or large.The atmosphere is luxurious and relaxing.The rooms are well thought out and designed.We had a huge balcony which doubled as another room!\nHuge shoutout to Victoria and Sonie who made our stay special",
    "date": "May 21, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 22, 2019",
        "text": "Dear DMS:\nThank you for your loyalty and for being our guest at The St. Regis Bal Harbour Resort. We are grateful for your most generous comments. We are pleased that we could provide you with a seamless and meaningful overall stay. I will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to the Miami area.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Holidave",
    "title": "Miami Honeymoon",
    "date": "May 19, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 21, 2019",
        "text": "Dear Holidave:\nIt was our pleasure welcoming you to The St. Regis Bal Harbour Resort for your very special occasion. We are delighted that your experience was perfect from beginning to end. We enjoy knowing that our guests can relax and feel at home in their gorgeously appointed rooms and awaken each morning to the gentle breeze of the Atlantic. On behalf of all of us, we thank you for taking the time to review our hotel, and we hope to see you again soon.\nAnd congratulations.\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Karen",
    "title": "Lovely Stay at St Regis Bal Harbour",
    "text": "Really enjoyed my return visit to this lovely hotel in a lovely spot. The staff and all amenities are top notch. I felt so relaxed and spoiled. Didn't want to go home!",
    "date": "May 19, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 20, 2019",
        "text": "Dear Karen: Thank you for again being our guest at The St. Regis Bal Harbour Resort and for your kind comments. We are pleased that we could provide you with a seamless and meaningful stay. I will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "JH",
    "title": "Beautiful Resort with Exceptional Staff",
    "text": "Absolutely stunning resort--located in a relatively quite area with an uncrowded beach, under-utilized pool amongst guests with phenomenal, welcoming and accommodating staff to ensure your stay is incredible.",
    "date": "May 17, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 19, 2019",
        "text": "Dear JH,\nOn behalf of our associates, thank you for the generous review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Mr",
    "title": "review",
    "text": "Beautiful property, stunning decor, and nice pool area\nBeach had a lot of seaweed which is minor and out of the hotel's control\nFound the staff rude and not very helpful",
    "date": "May 14, 2019",
    "score": 3.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 15, 2019",
        "text": "Hello:\nThank you for choosing us for your recent Miami visit and for your comments on our property. We are genuinely sorry however for the experience you had with staff. We strive to provide authentic and caring service from each member of our team, and we are grateful for feedback that helps us improve our services. We will share your concerns with the appropriate individuals to ensure this is not repeated in the future. We appreciate your patience and hope you will consider staying with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anonymous",
    "title": "Volveré",
    "text": "Luego de pasar una magnífica semana de convención de la compañía en este gran hotel, ahora a lo que aspiro es volver a disfrutar sus grandiosas instalaciones con mi familia. Volveré !",
    "date": "May 13, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 15, 2019",
        "text": "Hello:\nOn behalf of our associates, thank you for the generous review. As you've experienced, we are perfect for business, celebratory getaways or family vacations. The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again soon with your family.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "mrvino",
    "title": "Very good stay",
    "text": "The facilities, location and service were outstanding.",
    "date": "May 13, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 14, 2019",
        "text": "Dear mrvino:\nOn behalf of our associates, thank you for the outstanding review. Perfect for celebratory getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "JoyKapur",
    "title": "Overall experience",
    "text": "Hardly any service from butler.\nNo late checkout for gold elite.\nNo points given for stay.\nSmallest sink I have ever seen .",
    "date": "May 11, 2019",
    "score": 3.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 13, 2019",
        "text": "Dear JoyKapur:\nThank you for visiting and for taking the time to share your review. We are disappointed that we missed several significant opportunities to show you our commitment to service excellence. We regret not living up to our hotel's name, and want to thank you for your patience. We will take your points to heart and hope to have another opportunity on your next visit to Miami to provide you with the superb hospitality for which we are known and you deserve.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Ana",
    "title": "Café da manhã",
    "text": "Realmente nesta última estadia ficamos muito decepcionado Sports o Rest Atlantis estar fechado para o café da manhã e almoço",
    "date": "May 11, 2019",
    "score": 3.0,
    "location_score": 4.0,
    "responses": [
      {
        "author": "May 12, 2019",
        "text": "Dear Ana,\nThank you for reviewing your visit to our hotel. We take feedback such as yours very seriously as we are continually striving to elevate our guest experience. We hope you will accept our apologies, and we would welcome another opportunity to provide you with the perfect stay you deserve. Thank you again for sharing, and we wish you all the best with your travels.\nSincerely,\nH. Steenge-Hart\nGeneral Manager"
      }
    ]
  },
  {
    "author": "JJR0830",
    "title": "Fantastic Retreat",
    "text": "Had a wonderful stay and can’t wait to return",
    "date": "May 11, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 12, 2019",
        "text": "Dear JJR0830,\nOn behalf of our associates, thank you for the generous review. Perfect for romantic getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Anonymous",
    "title": "Grandeur & Relaxation- best resort",
    "date": "May 10, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "BNordin",
    "title": "Luxury...but at a price",
    "text": "Fabulous location and service...but found cost of food/beverage/incidentals uncomfortably high even for a business class T&E budget.",
    "date": "May 8, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 9, 2019",
        "text": "Dear BNordin:\nThank you for taking the time to tell us about your visit. We are pleased your overall stay was fabulous, but we want it to be flawless. Your comments are appreciated. Thank you for choosing our hotel, and we hope you will give us another opportunity to welcome you to the perfect stay you deserve.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "MaryRogers",
    "title": "Exceptional Experience",
    "text": "Loved every minute of stay at The St. Regis Bal Harbor. Excellent hotel and amazing service.",
    "date": "May 7, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 8, 2019",
        "text": "Dear MaryRogers:\nOn behalf of our associates, thank you for the generous review. Perfect for romantic getaways or family vacations, The St. Regis Bal Harbour Resort offers a haven of oceanfront elegance, refined luxury, and flawless service. We are pleased to know how much you loved your amazing stay, and we look forward to having you visit with us again.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "AWKhan",
    "title": "Good Location for Beach goers",
    "text": "Excellent location, nice clean and upscale amenities and high end technology fitted rooms. Nice place for quite or family getaway.",
    "date": "May 7, 2019",
    "score": 4.0,
    "location_score": 5.0
  },
  {
    "author": "JN",
    "title": "Amazing Staff",
    "date": "May 7, 2019",
    "score": 5.0,
    "location_score": 5.0
  },
  {
    "author": "MichaelOliverio",
    "title": "Poor customer service",
    "text": "I had a discount rate and at checkin and departure the hotel would not accept it even though I had proper documentation",
    "date": "May 1, 2019",
    "score": 1.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 2, 2019",
        "text": "Thank you for taking the time to share your valuable feedback. It has come to my attention that the rate received during your recent stay did not meet your expectations. Please accept my sincerely apologies if this may have caused any inconvenience.\nAs per our Explore Rate program guidelines, I would love the opportunity to speak with you more about the incident and in an effort to prevent this issue from occurring in the future. The experience you described is not characteristic of the level of service our associates strive to provide.\nPlease let me know the best contact number and time to reach you, or feel free to contact me via email anytime. I look forward to speaking with you in order to restore your confidence in the St. Regis Bal Harbour Resort.\nSincerely,\nKashmira Maneckji\nDirector of Operations\nThe St. Regis Resort Bal Habour"
      }
    ]
  },
  {
    "author": "MrD",
    "title": "Hotel service",
    "text": "Could not find a better resort that offers unbelievable service. I rate it a 10plus",
    "date": "April 30, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 1, 2019",
        "text": "Dear MrD,\nWe are grateful for your generous comments, and we are pleased that we could provide you with a seamless and meaningful stay. We will enjoy sharing your compliments with our team, and we hope to be your home every time your travels bring you to Miami.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Beachlover",
    "title": "Amazing property and staff; less than desirable hotel guests",
    "date": "April 29, 2019",
    "score": 4.0,
    "location_score": 4.0
  },
  {
    "author": "MIR",
    "title": "Excelente hotel en Bal Harbour!!",
    "text": "Me encantó el hotel, sin embargo cuenta con un gimnasio pequeño y la playa está sobrepoblada de reposeras.",
    "date": "April 29, 2019",
    "score": 5.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "May 1, 2019",
        "text": "Dear MIR,\nThank you for taking the time to tell us about your visit. We are pleased your overall stay was enjoyable, but we want it to be flawless. We are passionate about exceeding the expectations of our guests, and we genuinely apologize for not doing so during your time with us. Thank you for choosing our hotel, and we hope you will give us another opportunity to welcome you to the perfect stay you deserve.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "RubenV",
    "title": "Mal servicio de concierge y recepción",
    "text": "No me fue nada bien con el servicio de concierge, ni con algunos detalles en la habitación.",
    "date": "April 25, 2019",
    "score": 1.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "April 26, 2019",
        "text": "Dear RubenV,\nThank you for taking the time to evaluate our hotel. We are truly sorry your stay was not the exceptional experience you deserve. We never want a guest to leave with a contrary opinion, and if given the opportunity, we would have taken measures to address every concern while you were staying with us. We hope you will consider giving us another chance to provide you with the flawless and meaningful stay you deserve.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  },
  {
    "author": "Close2Perfect",
    "title": "So Many Positives, and Should Have Been a 10...but",
    "date": "April 25, 2019",
    "score": 4.0,
    "location_score": 5.0,
    "responses": [
      {
        "author": "April 26, 2019",
        "text": "Dear Close2Perfect,\nThank you for taking the time to tell us about your visit. We are pleased your overall stay was enjoyable, but we want it to be flawless. We are passionate about exceeding the expectations of our guests, and we genuinely apologize for not doing so during your time with us. Thank you for choosing our hotel, and we hope you will give us another opportunity to welcome you to the perfect stay you deserve.\nSincerely,\nGuest Recognition Manager"
      }
    ]
  }
]